avrxml/asf/thirdparty/wireless/avr2025_mac/addons/serial_if/src/serial_interface.c
/*
 * @brief Callback function usr_mlme_reset_conf
 *
 * @param status Result of the reset procedure
 */
void usr_mlme_reset_conf(uint8_t status)
{
	uint8_t *msg_buf;

	msg_buf = get_next_tx_buffer();
	*msg_buf++ = MLME_RESET_CONF_LEN + MAC_PID_LEN;
	*msg_buf++ = MAC_PID;
	*msg_buf++ = MLME_RESET_CONFIRM;
	*msg_buf++ = status;
	*msg_buf = EOT;
}

#if (defined MAC_SECURITY_ZIP || defined MAC_SECURITY_2006)

/**
 * @brief Handle fake frame interrupt
 *
 * This function handles transceiver fake frames and
 * uploads the frames from the trx.
 */
static inline void handle_fake_frame_irq(uint8_t *fake_frame)
{
	uint8_t ed_value;
	/* Actual frame length of received frame. */
	uint8_t phy_frame_len;
	/* Extended frame length appended by LQI and ED. */
	uint8_t ext_frame_length;
	frame_info_t *receive_frame;
	uint8_t *frame_ptr;

	receive_frame = (frame_info_t *)BMM_BUFFER_POINTER(tal_rx_buffer);

	/* Get ED value; needed to normalize LQI. */
	ed_value = trx_reg_read(RG_PHY_ED_LEVEL);

	/* Get frame length from transceiver. */
	/* trx_frame_read(&phy_frame_len, LENGTH_FIELD_LEN); */
	phy_frame_len = 0x2C;

	/*
	 * The PHY header is also included in the frame (length field), hence
	 * the frame length
	 * is incremented.
	 * In addition to that, the LQI and ED value are uploaded, too.
	 */
	ext_frame_length = phy_frame_len + LENGTH_FIELD_LEN + LQI_LEN +
			ED_VAL_LEN;

	/* Update payload pointer to store received frame. */
	frame_ptr = (uint8_t *)receive_frame + LARGE_BUFFER_SIZE -
			ext_frame_length;

	/*
	 * Note: The following code is different from single chip
	 * transceivers, since reading the frame via SPI contains the length
	 * field
	 * in the first octet.
	 */

	/* trx_frame_read(frame_ptr, LENGTH_FIELD_LEN + phy_frame_len +
	 * LQI_LEN); */
	memcpy(frame_ptr, fake_frame, LENGTH_FIELD_LEN + phy_frame_len +
			LQI_LEN);

	receive_frame->mpdu = frame_ptr;
	/* Add ED value at the end of the frame buffer. */
	receive_frame->mpdu[phy_frame_len + LQI_LEN + ED_VAL_LEN] = ed_value;

#if (defined BEACON_SUPPORT) || (defined ENABLE_TSTAMP)

	/*
	 * Store the timestamp.
	 * The time stamping is only required for beaconing networks
	 * or if time stamping is explicitly enabled.
	 */
	/* receive_frame->time_stamp = tal_rx_timestamp; */
#endif  /* #if (defined BEACON_SUPPORT) || (defined ENABLE_TSTAMP) */

	/* Append received frame to incoming_frame_queue and get new rx buffer.
	**/
	qmm_queue_append(&tal_incoming_frame_queue, tal_rx_buffer);

	/* The previous buffer is eaten up and a new buffer is not assigned yet.
	**/
	tal_rx_buffer = bmm_buffer_alloc(LARGE_BUFFER_SIZE);
}

#endif

#if (MAC_RX_ENABLE_SUPPORT == 1)

/*
 * Callback function usr_mlme_rx_enable_conf
 *
 * @param status           Result of requested receiver enable operation.
 *
 * @return void
 */
void usr_mlme_rx_enable_conf(uint8_t status)
{
	uint8_t *msg_buf;

	msg_buf = get_next_tx_buffer();
	*msg_buf++ = MLME_RX_ENABLE_CONF_LEN + MAC_PID_LEN;
	*msg_buf++ = MAC_PID;
	*msg_buf++ = MLME_RX_ENABLE_CONFIRM;
	*msg_buf++ = status;
	*msg_buf = EOT;
}

#endif  /* (MAC_RX_ENABLE_SUPPORT == 1) */

#if ((MAC_SCAN_ED_REQUEST_CONFIRM == 1)      ||	\
	(MAC_SCAN_ACTIVE_REQUEST_CONFIRM == 1)  || \
	(MAC_SCAN_PASSIVE_REQUEST_CONFIRM == 1) || \
	(MAC_SCAN_ORPHAN_REQUEST_CONFIRM == 1))

/*
 * @brief Callback function usr_mlme_scan_conf
 *
 * @param status            Result of requested scan operation
 * @param ScanType          Type of scan performed
 * @param ChannelPage       Channel page on which the scan was performed
 * @param UnscannedChannels Bitmap of unscanned channels
 * @param ResultListSize    Number of elements in ResultList
 * @param ResultList        Pointer to array of scan results
 */
void usr_mlme_scan_conf(uint8_t status,
		uint8_t ScanType,
		uint8_t ChannelPage,
		uint32_t UnscannedChannels,
		uint8_t ResultListSize,
		void *ResultList)
{
	uint8_t *msg_buf;
	/* Pointer to size element - the content is written later. */
	uint8_t *msg_ptr_to_size;

	msg_buf = get_next_tx_buffer();

	/* Store pointer to size element. */
	msg_ptr_to_size = msg_buf;

	*msg_buf++ = MLME_SCAN_CONF_LEN + MAC_PID_LEN;
	*msg_buf++ = MAC_PID;
	*msg_buf++ = MLME_SCAN_CONFIRM;

	*msg_buf++ = status;
	*msg_buf++ = ScanType;
	*msg_buf++ = ChannelPage;
	*msg_buf++ = UnscannedChannels;
	*msg_buf++ = UnscannedChannels >> 8;
	*msg_buf++ = UnscannedChannels >> 16;
	*msg_buf++ = UnscannedChannels >> 24;
	*msg_buf++ = ResultListSize;

	if ((MLME_SCAN_TYPE_ACTIVE == ScanType) ||
			(MLME_SCAN_TYPE_PASSIVE == ScanType)) {
		wpan_pandescriptor_t *wpan_desc_ptr
			= (wpan_pandescriptor_t *)ResultList;

		if (0 == ResultListSize) {
			*msg_buf++ = 0;
		} else {
			*msg_buf++ = ResultListSize * WPAN_DESCRIPTOR_LEN;

			for (uint8_t i = 0; i < ResultListSize; i++) {
				/*
				 * Since the wpan_desc_ptr_t might have various
				 * sizes depending
				 * on the platform type (8 bit vs. 32 bit), but
				 * the test
				 * harness requires strict 8 bit oriented
				 * structure layouts,
				 * the wpan descriptor cannot be copied via
				 * memcpy here.
				 */
				*msg_buf++
					= wpan_desc_ptr->CoordAddrSpec.AddrMode;
#ifdef TEST_HARNESS_BIG_ENDIAN
				*msg_buf++
					= wpan_desc_ptr->CoordAddrSpec.PANId >>
						8;
				*msg_buf++ = wpan_desc_ptr->CoordAddrSpec.PANId;
#else
				*msg_buf++ = wpan_desc_ptr->CoordAddrSpec.PANId;
				*msg_buf++
					= wpan_desc_ptr->CoordAddrSpec.PANId >>
						8;
#endif
				memcpy(msg_buf,
						&(wpan_desc_ptr->CoordAddrSpec.
						Addr),
						8);
				msg_buf += 8;

				*msg_buf++ = wpan_desc_ptr->LogicalChannel;
				*msg_buf++ = wpan_desc_ptr->ChannelPage;
				*msg_buf++ = wpan_desc_ptr->SuperframeSpec;
				*msg_buf++ = wpan_desc_ptr->SuperframeSpec >> 8;
				*msg_buf++ = wpan_desc_ptr->GTSPermit;
				*msg_buf++ = wpan_desc_ptr->LinkQuality;
#ifdef ENABLE_TSTAMP
				*msg_buf++ = wpan_desc_ptr->TimeStamp;
				*msg_buf++ = wpan_desc_ptr->TimeStamp >> 8;
				*msg_buf++ = wpan_desc_ptr->TimeStamp >> 16;
				*msg_buf++ = wpan_desc_ptr->TimeStamp >> 24;
#endif  /* ENABLE_TSTAMP */

