avrxml/asf/thirdparty/wireless/avr2025_mac/addons/serial_if/src/serial_interface.c
				wpan_desc_ptr++;
				*msg_ptr_to_size += WPAN_DESCRIPTOR_LEN;
			}
		}
	} else if (MLME_SCAN_TYPE_ED == ScanType) {
		if (0 == ResultListSize) {
			*msg_buf++ = 0;
		} else {
			*msg_buf++ = ResultListSize;
			memcpy(msg_buf, (uint8_t *)ResultList, ResultListSize);
			msg_buf += ResultListSize;
			*msg_ptr_to_size += ResultListSize;
		}
	} else { /* Orphan Scan */
		*msg_buf++ = ResultListSize;
		*msg_buf++ = 0; /* no variable part */
		*msg_ptr_to_size += 1;
	}

	*msg_buf = EOT;
}

#endif

/*
 * @brief Callback function usr_mlme_set_conf
 *
 * @param status        Result of requested PIB attribute set operation
 * @param PIBAttribute  Updated PIB attribute
 */
#if ((defined MAC_SECURITY_ZIP)  || (defined MAC_SECURITY_2006))
void usr_mlme_set_conf(uint8_t status,
		uint8_t PIBAttribute,
		uint8_t PIBAttributeIndex)

#else
void usr_mlme_set_conf(uint8_t status,
		uint8_t PIBAttribute)
#endif  /* (MAC_SECURITY_ZIP || MAC_SECURITY_2006) */
{
	uint8_t *msg_buf;

	msg_buf = get_next_tx_buffer();
	*msg_buf++ = MLME_SET_CONF_LEN + MAC_PID_LEN;
	*msg_buf++ = MAC_PID;
	*msg_buf++ = MLME_SET_CONFIRM;
	*msg_buf++ = status;
	*msg_buf++ = PIBAttribute;
#if ((defined MAC_SECURITY_ZIP)  || (defined MAC_SECURITY_2006))
	*msg_buf++ = PIBAttributeIndex;
#endif
	*msg_buf = EOT;
}

#if (MAC_START_REQUEST_CONFIRM == 1)

/*
 * @brief Callback function usr_mlme_start_conf
 *
 * @param status        Result of requested start operation
 */
void usr_mlme_start_conf(uint8_t status)
{
	uint8_t *msg_buf;

	msg_buf = get_next_tx_buffer();

	*msg_buf++ = MLME_START_CONF_LEN + MAC_PID_LEN;
	*msg_buf++ = MAC_PID;
	*msg_buf++ = MLME_START_CONFIRM;
	*msg_buf++ = status;

	*msg_buf = EOT;
}

#endif  /* (MAC_START_REQUEST_CONFIRM == 1) */

/*
 * Callback function usr_mlme_sync_loss_ind
 *
 * @param LossReason     Reason for synchronization loss.
 * @param PANId          The PAN identifier with which the device lost
 *                       synchronization or to which it was realigned.
 * @param LogicalChannel The logical channel on which the device lost
 *                       synchronization or to which it was realigned.
 * @param ChannelPage    The channel page on which the device lost
 *                       synchronization or to which it was realigned.
 *
 * @return void
 *
 */
void usr_mlme_sync_loss_ind(uint8_t LossReason,
		uint16_t PANId,
		uint8_t LogicalChannel,
		uint8_t ChannelPage)
{
	uint8_t *msg_buf;

	msg_buf = get_next_tx_buffer();
	*msg_buf++ = MLME_SYNC_LOSS_IND_LEN + MAC_PID_LEN;
	*msg_buf++ = MAC_PID;
	*msg_buf++ = MLME_SYNC_LOSS_INDICATION;
	*msg_buf++ = LossReason;
#ifdef TEST_HARNESS_BIG_ENDIAN
	*msg_buf++ = PANId >> 8;
	*msg_buf++ = PANId;
#else
	*msg_buf++ = PANId;
	*msg_buf++ = PANId >> 8;
#endif

	*msg_buf++ = LogicalChannel;
	*msg_buf++ = ChannelPage;
	*msg_buf = EOT;
}

#ifdef GTS_SUPPORT
#if (MAC_GTS_REQUEST == 1)
void usr_mlme_gts_conf(gts_char_t GtsChar, uint8_t status)
{
	uint8_t *msg_buf;

	msg_buf = get_next_tx_buffer();
	*msg_buf++ = MLME_GTS_CONF_LEN + MAC_PID_LEN;
	*msg_buf++ = MAC_PID;
	*msg_buf++ = MLME_GTS_CONFIRM;
	*msg_buf++ = *((uint8_t *)&GtsChar);
	*msg_buf++ = status;
	*msg_buf = EOT;
}

void usr_mlme_gts_ind(uint16_t DeviceAddr, gts_char_t GtsChar)
{
	uint8_t *msg_buf;

	msg_buf = get_next_tx_buffer();
	*msg_buf++ = MLME_GTS_IND_LEN + MAC_PID_LEN;
	*msg_buf++ = MAC_PID;
	*msg_buf++ = MLME_GTS_INDICATION;
#ifdef TEST_HARNESS_BIG_ENDIAN
	*msg_buf++ = DeviceAddr >> 8;
	*msg_buf++ = DeviceAddr;
#else
	*msg_buf++ = DeviceAddr;
	*msg_buf++ = DeviceAddr >> 8;
#endif
	*msg_buf++ = *((uint8_t *)&GtsChar);
	*msg_buf = EOT;
}

#endif /* (MAC_GTS_REQUEST == 1) */
#endif /* GTS_SUPPORT */

/**
 * \brief Parses the Received Data in the Buffer and Process the Commands
 * accordingly.
 */
static void handle_incoming_msg(void)
{
	bool ret_val;
	switch (sio_rx_buf[1]) { /* Protocol Identifier type*/
	case MAC_PID:
	{
		switch (sio_rx_buf[2]) { /* message type */
		case MCPS_DATA_REQUEST:
		{
			/* Order of reception:
			 * With MAC_SECURITY_ZIP:
			 *     size;
			 *                         ProtocolId;
			 *     cmdCode;
			 *     SrcAddrMode;
			 *     DstAddrMode;
			 *     DstPANId;
			 *     DstAddr;
			 *     msduHandle;
			 *     TxOptions;
			 *     SecurityLevel;
			 *     KeyIdMode;
			 *     KeyIndex;
			 *     msduLength;
			 *     msdu*;
			 *
			 *                          Without MAC_SECURITY:
			 *                          size;
			 *                              ProtocolId;
			 *                          cmdCode;
			 *                          SrcAddrMode;
			 *                          DstAddrMode;
			 *                          DstPANId;
			 *                          DstAddr;
			 *                          msduHandle;
			 *                          TxOptions;
			 *                          msduLength;
			 *                          msdu*;
			 */

			uint8_t src_addr_mode = sio_rx_buf[3];
			wpan_addr_spec_t dst_addr;

			dst_addr.AddrMode = sio_rx_buf[4];
			dst_addr.PANId
				= ((uint16_t)sio_rx_buf[5] |
					((uint16_t)sio_rx_buf[6]
					<< 8));
			memcpy(&dst_addr.Addr.long_address, &sio_rx_buf[7],
					sizeof(uint64_t));
			uint8_t msdu_handle = sio_rx_buf[15];
			uint8_t tx_options = sio_rx_buf[16];

#if (defined MAC_SECURITY_ZIP || defined MAC_SECURITY_2006)
			uint8_t security_level = sio_rx_buf[17];
			uint8_t key_id_mode = sio_rx_buf[18];
			uint8_t *key_source = NULL;

			if (key_id_mode == 3) {
				memcpy(key_source_8,
						&dst_addr.Addr.long_address, 8);
				key_source = key_source_8;
			} else if (key_id_mode == 2) {
				key_source_4[0] = (uint8_t)dst_addr.PANId;
				key_source_4[1]
					= (uint8_t)(dst_addr.PANId >> 8);

				/*                    key_source_4[2] =
				 * (uint8_t)(mac_sec_pib.PANCoordShortAddress);
				 **/

				/*                    key_source_4[3] =
				 * (uint8_t)(mac_sec_pib.PANCoordShortAddress >>
				 * 8); */
				key_source_4[2]
					= (uint8_t)(mac_pib.
						mac_CoordShortAddress);
				key_source_4[3]
					= (uint8_t)(mac_pib.
						mac_CoordShortAddress
						>> 8);
				key_source = key_source_4;
			}

			uint8_t key_index = sio_rx_buf[19];

			uint8_t msdu_length = sio_rx_buf[20];
			uint8_t *msdu = &sio_rx_buf[22];

			ret_val = wpan_mcps_data_req(src_addr_mode,
					&dst_addr,
					msdu_length,
					msdu,
					msdu_handle,
					tx_options,
					security_level,
					key_source,
					key_id_mode,
					key_index);
#else   /* No MAC_SECURITY */
			uint8_t msdu_length = sio_rx_buf[17];
			uint8_t *msdu = &sio_rx_buf[19];

