avrxml/asf/thirdparty/wireless/avr2025_mac/addons/serial_if/src/serial_interface.c
			/*
			 * bool wpan_mcps_data_req(uint8_t SrcAddrMode,
			 *                       wpan_addr_spec_t *DstAddrSpec,
			 *                       uint8_t msduLength,
			 *                       uint8_t *msdu,
			 *                       uint8_t msduHandle,
			 *                       uint8_t TxOptions);
			 */
			ret_val = wpan_mcps_data_req(src_addr_mode,
					&dst_addr,
					msdu_length,
					msdu,
					msdu_handle,
					tx_options);
#endif  /* MAC_SECURITY */

			/*
			 * No Assert for MCPS-DATA request, since a too large
			 * payload
			 * will also return true, but this is correct behavior
			 * in the
			 * test case then.
			 */
		}
		break;

#if ((MAC_PURGE_REQUEST_CONFIRM == 1) && (MAC_INDIRECT_DATA_BASIC == 1))
		case MCPS_PURGE_REQUEST:
		{
			/* Order of reception:
			 *     size;
			 *     cmdCode;
			 *     msduHandle uint8_t;
			 */

			/*
			 * bool wpan_mcps_purge_req(const uint8_t msduHandle);
			 */

			ret_val = wpan_mcps_purge_req(sio_rx_buf[3]);

			if (ret_val == false) {
				Assert(
						"Test harness: Purge Request not successful" ==
						0);
			}
		}
		break;
#endif  /* ((MAC_PURGE_REQUEST_CONFIRM == 1) && (MAC_INDIRECT_DATA_BASIC == 1))
				**/

#if (MAC_ASSOCIATION_REQUEST_CONFIRM == 1)
		case MLME_ASSOCIATE_REQUEST:
		{
			/* Order of reception:
			 * size;
			 * ProtocolId,
			 * cmdCode;
			 * LogicalChannel uint8_t;
			 * ChannelPage uint8_t;
			 * CoordAddrMode uint8_t;
			 * CoordPANId uint16_t;
			 * CoordAddress address_field_t;
			 * CapabilityInformation uint8_t;
			 */

			/*
			 * bool wpan_mlme_associate_req(uint8_t LogicalChannel,
			 *                            uint8_t ChannelPage,
			 *                            wpan_addr_spec_t
			 * *CoordAddrSpec,
			 *                            uint8_t
			 * CapabilityInformation);
			 */

			wpan_addr_spec_t coord_addr;

			coord_addr.AddrMode = sio_rx_buf[5];
			coord_addr.PANId
				= ((uint16_t)sio_rx_buf[6] |
					((uint16_t)sio_rx_buf[7]
					<< 8));
			memcpy(&coord_addr.Addr.long_address, &sio_rx_buf[8],
					sizeof(uint64_t));
			ret_val = wpan_mlme_associate_req(sio_rx_buf[3],
					sio_rx_buf[4],
					&coord_addr,
					sio_rx_buf[16]);
			if (ret_val == false) {
				Assert(
						"Test harness: Associate Request not successful" ==
						0);
			}
		}
		break;
#endif  /* (MAC_ASSOCIATION_REQUEST_CONFIRM == 1) */

#if (MAC_ASSOCIATION_INDICATION_RESPONSE == 1)
		case MLME_ASSOCIATE_RESPONSE:
		{
			/* Order of reception:
			 * size;
			 * ProtocolId,
			 * cmdCode;
			 * DeviceAddress uint64_t;
			 * AssocShortAddress uint16_t;
			 * status uint8_t;
			 */

			/*
			 * bool wpan_mlme_associate_resp(uint64_t DeviceAddress,
			 *                             uint16_t
			 * AssocShortAddress,
			 *                             uint8_t status);
			 */

			ret_val
				= wpan_mlme_associate_resp(((uint64_t)sio_rx_buf
					[
						3] |
					((uint64_t)sio_rx_buf[4]
					<< 8) |
					(uint64_t)sio_rx_buf[5] << 16 |
					((uint64_t)sio_rx_buf[6]
					<< 24) |
					(uint64_t)sio_rx_buf[7] << 32 |
					((uint64_t)sio_rx_buf[8]
					<< 40) |
					(uint64_t)sio_rx_buf[9] << 48 |
					((uint64_t)sio_rx_buf[10
					] << 56)),
					(uint16_t)sio_rx_buf[11] |
					((uint16_t)sio_rx_buf[12
					] << 8),
					sio_rx_buf[13]);
			if (ret_val == false) {
				Assert(
						"Test harness: Associate Reqsponse not successful" ==
						0);
			}
		}
		break;
#endif  /* (MAC_ASSOCIATION_INDICATION_RESPONSE == 1) */

		case MLME_DISASSOCIATE_REQUEST:
		{
			/* Order of reception:
			 * size;
			 * ProtocolId,
			 * cmdCode;
			 * DeviceAddrMode uint8_t;
			 * DevicePANId uint16_t;
			 * DeviceAddress uint64_t;
			 * DisassociateReason uint8_t;
			 * TxIndirect uint8_t;
			 */

			/*
			 * bool wpan_mlme_disassociate_req(wpan_addr_spec_t
			 * *DeviceAddrSpec,
			 *                               uint8_t
			 * DisassociateReason,
			 *                               bool TxIndirect);
			 */

			wpan_addr_spec_t dev_addr;

			dev_addr.AddrMode = sio_rx_buf[3];
			dev_addr.PANId
				= ((uint16_t)sio_rx_buf[4] |
					((uint16_t)sio_rx_buf[5]
					<< 8));
#ifdef TEST_HARNESS_BIG_ENDIAN
			if (FCF_SHORT_ADDR == dev_addr.AddrMode) {
				memcpy(&dev_addr.Addr.short_address,
						&sio_rx_buf[6],
						sizeof(uint16_t));
			} else {
				memcpy(&dev_addr.Addr.long_address,
						&sio_rx_buf[6],
						sizeof(uint64_t));
			}

#else
			memcpy(&dev_addr.Addr.long_address, &sio_rx_buf[6],
					sizeof(uint64_t));
#endif

			ret_val = wpan_mlme_disassociate_req(&dev_addr,
					sio_rx_buf[14],
					sio_rx_buf[15]);
			if (ret_val == false) {
				Assert(
						"Test harness: Disassociate Request not successful" ==
						0);
			}
		}
		break;

		case MLME_GET_REQUEST:

			/* Order of reception:
			 * size;
			 * ProtocolId,
			 * cmdCode;
			 * PIBAttribute uint8_t;
			 */

			/*
			 * bool wpan_mlme_get_req(uint8_t PIBAttribute);
			 */

#if ((defined MAC_SECURITY_ZIP)  || (defined MAC_SECURITY_2006))
			ret_val
				= wpan_mlme_get_req(sio_rx_buf[3],
					sio_rx_buf[4]);
#else
			ret_val = wpan_mlme_get_req(sio_rx_buf[3]);
#endif  /* (MAC_SECURITY_ZIP || MAC_SECURITY_2006) */

			if (ret_val == false) {
				Assert(
						"Test harness: Get Request not successful" ==
						0);
			}

			break;

#if (MAC_ORPHAN_INDICATION_RESPONSE == 1)
		case MLME_ORPHAN_RESPONSE:
		{
			/* Order of reception:
			 * size;
			 * ProtocolId,
			 * cmdCode;
			 * OrphanAddress uint64_t;
			 * ShortAddress uint16_t;
			 * AssociatedMember uint8_t;
			 */

			/*
			 * bool wpan_mlme_orphan_resp(uint64_t OrphanAddress,
			 *                          uint16_t ShortAddress,
			 *                          bool );
			 */

			ret_val
				= wpan_mlme_orphan_resp(((uint64_t)sio_rx_buf[3]
					|
					((uint64_t)sio_rx_buf[4]
					<< 8) |
					(uint64_t)sio_rx_buf[5] << 16 |
					((uint64_t)sio_rx_buf[6]
					<< 24) |
					(uint64_t)sio_rx_buf[7] << 32 |
					((uint64_t)sio_rx_buf[8]
					<< 40) |
					(uint64_t)sio_rx_buf[9] << 48 |
					((uint64_t)sio_rx_buf[10
					] << 56)),
					/* ShortAddress */
					(uint16_t)sio_rx_buf[11] |
					((uint16_t)sio_rx_buf[12
					] << 8),
					/* AssociatedMember */
					sio_rx_buf[13]);

			if (ret_val == false) {
				Assert(
						"Test harness: Orphan Response not successful" ==
						0);
			}
		}
		break;
#endif  /* (MAC_ORPHAN_INDICATION_RESPONSE == 1) */

