avrxml/asf/thirdparty/wireless/avr2025_mac/addons/serial_if/src/serial_interface.c
#if (MAC_SYNC_REQUEST == 1)
		case MLME_SYNC_REQUEST:

			/* Order of reception:
			 * size;
			 * ProtocolId,
			 * cmdCode;
			 * LogicalChannel uint8_t;
			 * ChannelPage uint8_t;
			 * TrackBeacon uint8_t;
			 */

			/*
			 * bool wpan_mlme_sync_req(uint8_t LogicalChannel,
			 *                       uint8_t ChannelPage,
			 *                       bool TrackBeacon);
			 */
			ret_val = wpan_mlme_sync_req(sio_rx_buf[3],
					sio_rx_buf[4],
					sio_rx_buf[5]);
			if (ret_val == false) {
				Assert(
						"Test harness: Sync Request not successful" ==
						0);
			}
			break;
#endif /* (MAC_SYNC_REQUEST == 1) */

#if (defined MAC_SECURITY_ZIP || defined MAC_SECURITY_2006)
		case MAC_INC_FRAME:
			/* mac_process_tal_data_ind(&sio_rx_buf[3]); */

			handle_fake_frame_irq(&sio_rx_buf[4]);
			break;
#endif

#ifdef GTS_SUPPORT
#if (MAC_GTS_REQUEST == 1)
		case MLME_GTS_REQUEST:
		{
			uint16_t DevAddr = ((uint16_t)sio_rx_buf[3] |
					((uint16_t)sio_rx_buf[4] << 8));

			/* Order of reception:
			 * size;
			 * ProtocolId,
			 * cmdCode;
			 *
			 */

			/*
			 * bool wpan_mlme_sync_req(uint8_t LogicalChannel,
			 *                       uint8_t ChannelPage,
			 *                       bool TrackBeacon);
			 */
			ret_val
				= wpan_mlme_gts_req(DevAddr,
					*((gts_char_t *)&sio_rx_buf[
						5]));
			if (ret_val == false) {
				Assert(
						"Test harness: GTS Request not successful" ==
						0);
			}

			break;
		}
#endif /* (MAC_GTS_REQUEST == 1) */
#endif /* GTS_SUPPORT */
		default:
			Assert("???" == 0);
			break;
		}
	}
	break;

	default:
		Assert("???" == 0);
		break;
	}
}

/**
 * @brief Process data received from SIO
 */
static inline void process_incoming_sio_data(void)
{
	switch (sio_rx_state) {
	case UART_RX_STATE_SOT:
		sio_rx_ptr = sio_rx_buf;
		if (SOT == data[rx_index]) {
			sio_rx_state = UART_RX_STATE_LENGTH;
		}

		break;

	case UART_RX_STATE_LENGTH:
		sio_rx_length = data[rx_index];
		if (sio_rx_length) {
			sio_rx_state = UART_RX_STATE_DATA;
			*sio_rx_ptr = sio_rx_length;
			sio_rx_ptr++;
		} else {
			/* NULL message */
			sio_rx_ptr = sio_rx_buf;
			sio_rx_state = UART_RX_STATE_SOT;
		}

		break;

	case UART_RX_STATE_DATA:
		*sio_rx_ptr = data[rx_index];
		sio_rx_ptr++;
		sio_rx_length--;
		if (!sio_rx_length) {
			sio_rx_state = UART_RX_STATE_EOT;
		}

		break;

	case UART_RX_STATE_EOT:
		if (EOT == data[rx_index]) {
			/* Message received successfully */
			handle_incoming_msg();
		}

		/* Make rx buffer ready for next reception before handling
		 * received data. */
		sio_rx_ptr = sio_rx_buf;
		sio_rx_state = UART_RX_STATE_SOT;
		break;

	default:
		sio_rx_ptr = sio_rx_buf;
		sio_rx_state = UART_RX_STATE_SOT;
		break;
	}
}

/*
 * @brief Function to handle the state machine serial data exchange.
 */
void serial_data_handler(void)
{
	/* Rx processing */
	if (data_length == 0) {
		/* No data to process, read the stream IO */
		rx_index = 0;
		data_length = sio2host_rx(data, SIO_RX_BUF_SIZE); /* @ToDo 20 ?,
		                                                   * different
		                                                   * values for
		                                                   * USB and
		                                                   * UART ? */
	} else { /* Data has been received, process the data */
		 /* Process each single byte */
		process_incoming_sio_data();
		data_length--;
		rx_index++;
	}

	/* Tx processing */
	if (buf_count != 0) {
		if (sio2host_tx(sio_tx_buf[head],
				(sio_tx_buf[head][1] + 3)) != 0) {
			head++;
			head %= SIO_BUF_COUNT;
			buf_count--;
		} else {
			/* @ToDo what happens if none or only a part of the
			 * bytes could be transmitted? */
		}
	}
}
